In [ ]:
#판다스는 2가지 오브젝트 Series, DataFrame이 있다. 

1) Series: 1차원 데이터와 인덱스로 구성(하나의 컬럼)
2) Dataframe : 2차원 데이터와 인덱스로 구성(여러개의 컬럼)

In [2]:
# Series 만들기 

import pandas as pd 
import numpy as np 

# pandas.Series(data, index, dtype, copy) 
# index는 Optional 하다. 
# data의 형태는 리스트, 딕셔너리, 튜플 등의 형태 가능.

In [3]:
# 튜플을 이용해서 만들깅
data = ("yuna","2000-20-20","여자") 
s = pd.Series(data, index =["이름","생년월일","성별"] )

In [4]:
s

이름            yuna
생년월일    2000-20-20
성별              여자
dtype: object

In [7]:
s.index  # 인덱스만 불러오기

Index(['이름', '생년월일', '성별'], dtype='object')

In [8]:
s.values # 값만 불러오기

array(['yuna', '2000-20-20', '여자'], dtype=object)

In [9]:
s[0]  # 0 인덱스의 값을 가져온다.

'yuna'

In [10]:
s[0:2]  # 0 ~ 1 인덱스의 값을 가져온다.

이름            yuna
생년월일    2000-20-20
dtype: object

In [11]:
# dictionary를 이용한 Series 생성 

dic = {"a":1,"b":2,"c":3}
ds = pd.Series(dic)
ds

a    1
b    2
c    3
dtype: int64

In [12]:
# dataframe 만들기 

data = {"이름":["연아","민영","수민"],"나이":[10,12,12],"취미":["음악감상","운동","독서"]}
df = pd.DataFrame(data)
df

   이름  나이    취미
0  연아  10  음악감상
1  민영  12    운동
2  수민  12    독서

In [29]:
df = pd.DataFrame(data, index = ["일","이","삼"]) # row 이름 붙이깅
df

   이름  나이    취미
일  연아  10  음악감상
이  민영  12    운동
삼  수민  12    독서

In [30]:
# 행 & 이름 변경하기 
# DataFrame 객체.index = []
# DataFrame 객체.columns = []
df.index = ["첫번째","둘째","셋째"]
df.columns = ["Name","Age","Hobby"]
df

    Name  Age Hobby
첫번째   연아   10  음악감상
둘째    민영   12    운동
셋째    수민   12    독서

In [31]:
#  행 인덱스 & 열 이름 변경 (2) 
# DataFrame 객체.rename(index={기존 인덱스:새 인덱스,---})
# DataFrame 객체.rename(columns={기존 이름:새 이름, ---})
df.rename(columns = {"Name":"이름","Age":"나이","Hobby":"취미"}, inplace = True)
df.rename(index = {"첫번째":"1st", "둘째":"2nd", "셋째":"3rd"}, inplace = True)
df

     이름  나이    취미
1st  연아  10  음악감상
2nd  민영  12    운동
3rd  수민  12    독서

In [32]:
# 행  & 열 삭제 
# 행 삭제 : DataFrame 객체.drop('행 인덱스' 또는 ['배열'], axis=0)
# 열 삭제 : DataFrame 객체.drop('열 이름' 또는 ['배열'], axis=1)

df.drop("2nd", axis = 0, inplace = True ) # 행 이름이 "2nd" 를 삭제하자 
df

     이름  나이    취미
1st  연아  10  음악감상
3rd  수민  12    독서

In [33]:
df.drop("나이", axis = 1, inplace = True)  # 열 이름이 나이를 삭제하자 
df

     이름    취미
1st  연아  음악감상
3rd  수민    독서

In [35]:
# 데이터프레임 만들기(2)

exam = pd.DataFrame({"수학":[100,20,30],"영어":[90,39,30],"국어":[80,50,30] , "체육":[60,50,40]}
                   , index = ["연아","연아2","연아3"]) 

exam

      수학  영어  국어  체육
연아   100  90  80  60
연아2   20  39  50  50
연아3   30  30  30  40

In [38]:
# 특정 행 선택하기 
# .loc 인덱스 이름으로 
# .iloc 인덱스 위치로 

index1 = exam.loc["연아"]
index2 = exam.iloc[0:2]
print(index1)  
print("\n")
print(index2)

수학    100
영어     90
국어     80
체육     60
Name: 연아, dtype: int64


      수학  영어  국어  체육
연아   100  90  80  60
연아2   20  39  50  50

In [39]:
math = exam["수학"]
print(math)

연아     100
연아2     20
연아3     30
Name: 수학, dtype: int64

In [41]:
Eng = exam.영어
print(Eng)

연아     90
연아2    39
연아3    30
Name: 영어, dtype: int64

In [43]:
subject = exam[["수학","체육"]]
subject

      수학  체육
연아   100  60
연아2   20  50
연아3   30  40

In [44]:
# 행/ 열 추가 
# 행추가 : DataFrame.loc['새로운 행 이름'] = 데이터 값 (또는 배열)
exam.loc["연아4"] = [10,20,30,40]
exam.loc["연아5"] = 1 
exam.loc["연아6"] = exam.loc["연아5"]
exam

      수학  영어  국어  체육
연아   100  90  80  60
연아2   20  39  50  50
연아3   30  30  30  40
연아4   10  20  30  40
연아5    1   1   1   1
연아6    1   1   1   1

In [46]:
# 열 추가하기
# 열 추가 : DataFrame 객체[ '추가하려는 열 이름' ] = 데이터 값

exam["음악"] = 10,20,30,40,50,60
exam

      수학  영어  국어  체육  음악
연아   100  90  80  60  10
연아2   20  39  50  50  20
연아3   30  30  30  40  30
연아4   10  20  30  40  40
연아5    1   1   1   1  50
연아6    1   1   1   1  60

In [47]:
# 행, 열 함께 선택하기 
# 인덱스 이름 : DataFrame 객체.loc[행 이름, 열 이름]
# 정수 위치 인덱스 : DataFrame 객체.iloc[행 번호, 열 번호]
# 원소 1개 추출
a = exam.loc["연아", "체육"]
a

60

In [49]:
b = exam.iloc[1,2]
b

50

In [50]:
# 원소 2개 추출
c = exam.loc["연아",["수학","영어"]]
c

수학    100
영어     90
Name: 연아, dtype: int64

In [51]:
d = exam.loc["연아","수학":"음악"]
d

수학    100
영어     90
국어     80
체육     60
음악     10
Name: 연아, dtype: int64

In [52]:
e = exam.iloc[0,1:]
e

영어    90
국어    80
체육    60
음악    10
Name: 연아, dtype: int64

In [53]:
# 행, 열 각각 2개 이상 추출하여 Dataframe 으로 만들기 

exam.loc[["연아","연아2"],["수학","음악"]]

      수학  음악
연아   100  10
연아2   20  20

In [55]:
exam.loc["연아",["수학", "영어"]] = 70,60 
exam # 연아 행의 수학, 영어 점수가 70,60으로 바뀐것을 알 수 있다.

     수학  영어  국어  체육  음악
연아   70  60  80  60  10
연아2  20  39  50  50  20
연아3  30  30  30  40  30
연아4  10  20  30  40  40
연아5   1   1   1   1  50
연아6   1   1   1   1  60

In [57]:
exam.iloc[0, [1,2]] = 11, 22  # 0행, 즉 연아 행의 1,2 컬럼(영어, 국어)의 점수가 11, 22으로 바뀜
exam

     수학  영어  국어  체육  음악
연아   70  11  22  60  10
연아2  20  39  50  50  20
연아3  30  30  30  40  30
연아4  10  20  30  40  40
연아5   1   1   1   1  50
연아6   1   1   1   1  60

In [60]:
exam.transpose()  # 행, 열 위치 바꾸깅

    연아  연아2  연아3  연아4  연아5  연아6
수학  70   20   30   10    1    1
영어  11   39   30   20    1    1
국어  22   50   30   30    1    1
체육  60   50   40   40    1    1
음악  10   20   30   40   50   60

In [ ]:
# 인덱스 활용
# 1) .set_index  특정 열을 행 인덱스로 정한다 
# 특정 열을 행 인덱스로 설정 : DataFrame 객체.set_index( ['열 이름' ] 또는 '열 이름')
# 원본 데이터 프레임을 바꾸지 않고 새로운 데이터 프레임을 반환

In [64]:
# 수학열을 인덱스로 설정하자 
df = exam.set_index(["수학"])
df

    영어  국어  체육  음악
수학
70  11  22  60  10
20  39  50  50  20
30  30  30  40  30
10  20  30  40  40
1    1   1   1  50
1    1   1   1  60

In [65]:
df2 = exam.set_index(["수학","영어"])
df2

       국어  체육  음악
수학 영어
70 11  22  60  10
20 39  50  50  20
30 30  30  40  30
10 20  30  40  40
1  1    1   1  50
   1    1   1  60

In [66]:
# 행 인덱스 (.reindex)
# 새로운 배열로 행 인덱스를 재지정 : DataFrame 객체.reindex(새로운 인덱스 배열)

new_index = ["연아","연아2","연아3","yuna","yuna2","yuna3"]
exam.reindex(new_index)
# 기존에 존재않는 행 인덱스가 새로 생길 경우 값은 NaN 가 된다

         수학    영어    국어    체육    음악
연아     70.0  11.0  22.0  60.0  10.0
연아2    20.0  39.0  50.0  50.0  20.0
연아3    30.0  30.0  30.0  40.0  30.0
yuna    NaN   NaN   NaN   NaN   NaN
yuna2   NaN   NaN   NaN   NaN   NaN
yuna3   NaN   NaN   NaN   NaN   NaN

In [67]:
# 3) 행 인덱스 초기화 reset_index()
exam.reset_index()

  index  수학  영어  국어  체육  음악
0    연아  70  11  22  60  10
1   연아2  20  39  50  50  20
2   연아3  30  30  30  40  30
3   연아4  10  20  30  40  40
4   연아5   1   1   1   1  50
5   연아6   1   1   1   1  60

In [75]:
# 4) 행 인덱스를기준으로 데이터 프레임 정렬 .sort_index()
# ascending=True or False 옵션을 사용해 오름차순 또는 내림차순을 설정

a = exam.sort_index(ascending = False) # 내림차순 
b = exam.sort_index(ascending = True) # 오름차순
print(a)
print(b)

     수학  영어  국어  체육  음악
연아6   1   1   1   1  60
연아5   1   1   1   1  50
연아4  10  20  30  40  40
연아3  30  30  30  40  30
연아2  20  39  50  50  20
연아   70  11  22  60  10
     수학  영어  국어  체육  음악
연아   70  11  22  60  10
연아2  20  39  50  50  20
연아3  30  30  30  40  30
연아4  10  20  30  40  40
연아5   1   1   1   1  50
연아6   1   1   1   1  60

In [76]:
print(exam.sort_values(by = "수학"))  # 수학점수 오름차순
# 특정 열(수학)를 기준으로 데이터 값을 기준으로 정렬하기 
print("\n")
print(exam.sort_values(by = "수학", ascending = False)) # 수학점수 내림차순

     수학  영어  국어  체육  음악
연아5   1   1   1   1  50
연아6   1   1   1   1  60
연아4  10  20  30  40  40
연아2  20  39  50  50  20
연아3  30  30  30  40  30
연아   70  11  22  60  10


     수학  영어  국어  체육  음악
연아   70  11  22  60  10
연아3  30  30  30  40  30
연아2  20  39  50  50  20
연아4  10  20  30  40  40
연아5   1   1   1   1  50
연아6   1   1   1   1  60